#########################################

v1 = c(1,2,3,4,5)
v1

v2 = -5:5 # -5에서 5까지 정수 생성
v2

v3 = seq(from=1, to=5, by=0.5) # 1부터 5까지 0.5 간격으로 생성
v3

v4 = rnorm(20) #난수 20개 생성
v4

########################################

mean(v1) # x의 평균

order(v1) # x를 오름차순 으로 정렬

rev(v1) # x를 내림차순 으로 정렬

sd(v1) # x의 표준편차

sort(v1, decreasing = TRUE) 

sort(v1, decreasing = FALSE)

length(v1)

########################################

x = c(1,4,6,8,9)
x

x[2]

x[-2]

x[3] = 4
x

x[2<x & x<5]

########################################

x = c(1,4,6,8,9)
x

y = replace(x, c(2,4), c(32,24))
y

w = append(x,y)
x

z = append(x,y,after=2)

c(1,2)+c(4,5)

c(1,2,3)+1

########################################

x = c(1,2,3)
y = c(4,5,6)

x==y # 순서에 따른 집합 비교

union(x,y) # 합집합 (중복 제거된 전체값)

intersect(x,y) # 교집합

setdiff(x,y) # 차집합 (x, -y)

setequal(x,y) # 같은 집합인지 비교

is.element(3,x) # 값이 x에 포함되는지 여부 

########################################

(x=rep(c("a", "b", "c"), times=4))

unique(x)

match(x, c("a"))

(y = c("d", "e", "f"))

(z = paste(x[1], y[3]))

#######################################

x = runif(5) # 0-1 사이값 5개 생성
x

(0.4 <= x) & (x <= 0.7) # see if x is within 0.4 ~ 0.7

any(x > 0.8)

all(x < 0.7)

is.vector(x)

